cmsis-svd/cmsis-svd/data/Fujitsu/MB9BF52xT.xml
        <!-- REGISTER "NEWDT1" -->
        <register>
          <name>NEWDT1</name>
          <description>CAN New Data Registers 1</description>
          <addressOffset>0x90</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NEWDAT16" -->
            <field>
              <name>NEWDAT16</name>
              <description>Bit15 of NEWDT1</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT15" -->
            <field>
              <name>NEWDAT15</name>
              <description>Bit14 of NEWDT1</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT14" -->
            <field>
              <name>NEWDAT14</name>
              <description>Bit13 of NEWDT1</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT13" -->
            <field>
              <name>NEWDAT13</name>
              <description>Bit12 of NEWDT1</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT12" -->
            <field>
              <name>NEWDAT12</name>
              <description>Bit11 of NEWDT1</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT11" -->
            <field>
              <name>NEWDAT11</name>
              <description>Bit10 of NEWDT1</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT10" -->
            <field>
              <name>NEWDAT10</name>
              <description>Bit9 of NEWDT1</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT9" -->
            <field>
              <name>NEWDAT9</name>
              <description>Bit8 of NEWDT1</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT8" -->
            <field>
              <name>NEWDAT8</name>
              <description>Bit7 of NEWDT1</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT7" -->
            <field>
              <name>NEWDAT7</name>
              <description>Bit6 of NEWDT1</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT6" -->
            <field>
              <name>NEWDAT6</name>
              <description>Bit5 of NEWDT1</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT5" -->
            <field>
              <name>NEWDAT5</name>
              <description>Bit4 of NEWDT1</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT4" -->
            <field>
              <name>NEWDAT4</name>
              <description>Bit3 of NEWDT1</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT3" -->
            <field>
              <name>NEWDAT3</name>
              <description>Bit2 of NEWDT1</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT2" -->
            <field>
              <name>NEWDAT2</name>
              <description>Bit1 of NEWDT1</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT1" -->
            <field>
              <name>NEWDAT1</name>
              <description>Bit0 of NEWDT1</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NEWDT2" -->
        <register>
          <name>NEWDT2</name>
          <description>CAN New Data Registers 2</description>
          <addressOffset>0x92</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NEWDAT32" -->
            <field>
              <name>NEWDAT32</name>
              <description>Bit15 of NEWDT2</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT31" -->
            <field>
              <name>NEWDAT31</name>
              <description>Bit14 of NEWDT2</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT30" -->
            <field>
              <name>NEWDAT30</name>
              <description>Bit13 of NEWDT2</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT29" -->
            <field>
              <name>NEWDAT29</name>
              <description>Bit12 of NEWDT2</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT28" -->
            <field>
              <name>NEWDAT28</name>
              <description>Bit11 of NEWDT2</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT27" -->
            <field>
              <name>NEWDAT27</name>
              <description>Bit10 of NEWDT2</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT26" -->
            <field>
              <name>NEWDAT26</name>
              <description>Bit9 of NEWDT2</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT25" -->
            <field>
              <name>NEWDAT25</name>
              <description>Bit8 of NEWDT2</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT24" -->
            <field>
              <name>NEWDAT24</name>
              <description>Bit7 of NEWDT2</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT23" -->
            <field>
              <name>NEWDAT23</name>
              <description>Bit6 of NEWDT2</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT22" -->
            <field>
              <name>NEWDAT22</name>
              <description>Bit5 of NEWDT2</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT21" -->
            <field>
              <name>NEWDAT21</name>
              <description>Bit4 of NEWDT2</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT20" -->
            <field>
              <name>NEWDAT20</name>
              <description>Bit3 of NEWDT2</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT19" -->
            <field>
              <name>NEWDAT19</name>
              <description>Bit2 of NEWDT2</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT18" -->
            <field>
              <name>NEWDAT18</name>
              <description>Bit1 of NEWDT2</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NEWDAT17" -->
            <field>
              <name>NEWDAT17</name>
              <description>Bit0 of NEWDT2</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
